FV2410/E_0549.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">6.50.1: AD Reklamation einer Definition des NB vom MSB an NB</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0549</B><BR align="left"/><FONT>Prüfende Rolle: <B>NB</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Reklamiert der Anfragende das Fehlen der ausgerollten Zählzeitdefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Entspricht der Code der Zählzeitdefinition einem Code aus der für den<BR align="left"/>reklamierten Zeitraum gültigen Übersicht der Zählzeitdefinitionen?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Code der Zählzeitdefinition wird nicht verwendet<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>30: </B>Wurde die ausgerollte Zählzeitdefinition an den Anfragenden versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Zählzeitdefinition wurde versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Zählzeitdefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Reklamiert der Anfragende eine unplausible ausgerollte Zählzeitdefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Wurde mit dem Code der Zählzeitdefinition bereits eine ausgerollte<BR align="left"/>Zählzeitdefinition mit einer höheren Version versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Es wurde bereits eine ausgerollte Zählzeitdefinition für den Code der<BR align="left"/>Zählzeitdefinition mit einer höheren Version versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Zählzeitdefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>60: </B>Ist die versendete ausgerollte Zählzeitdefinition plausibel?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Zählzeitdefinition ist plausibel<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>70: </B>Reklamiert der Anfragende das Fehlen der ausgerollten Schaltzeitdefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>80: </B>Entspricht der Code der Schaltzeitdefinition einem Code aus der für den<BR align="left"/>reklamierten Zeitraum gültigen Übersicht der Schaltzeitdefinitionen?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Code der Schaltzeitdefinition wird nicht verwendet<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>90: </B>Wurde die ausgerollte Schaltzeitdefinition an den Anfragenden versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A06" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A06</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Schaltzeitdefinition wurde versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Schaltzeitdefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>100: </B>Reklamiert der MSB eine unplausible ausgerollte Schaltzeitdefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>110: </B>Wurde mit dem Code der Schaltzeitdefinition bereits eine ausgerollte<BR align="left"/>Schaltzeitdefinition mit einer höheren Version versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A07" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A07</B><BR align="left"/><BR align="left"/><FONT>Es wurde bereits eine ausgerollte Schaltzeitdefinition für den Code der<BR align="left"/>Schaltzeitdefinition mit einer höheren Version versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Schaltzeitdefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>120: </B>Ist die versendete ausgerollte Schaltzeitdefinition plausibel?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A08" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A08</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Schaltzeitdefinition ist plausibel<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>130: </B>Reklamiert der Anfragende das Fehlen der ausgerollten Leistungskurvendefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "140" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>140: </B>Entspricht der Code der Leistungskurvendefinition einem Code aus der für den<BR align="left"/>reklamierten Zeitraum gültigen Übersicht der Leistungskurvendefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A09" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A09</B><BR align="left"/><BR align="left"/><FONT>Code der Leistungskurvendefinition wird nicht verwendet<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "150" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>150: </B>Wurde die ausgerollte Leistungskurvendefinition an den Anfragenden versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A10</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Leistungskurvendefinition wurde versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Leistungskurvendefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "160" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>160: </B>Reklamiert der Anfragende eine unplausible ausgerollte<BR align="left"/>Leistungskurvendefinition?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "170" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>170: </B>Wurde mit dem Code der Leistungskurvendefinition bereits eine ausgerollte<BR align="left"/>Leistungskurvendefinition mit einer höheren Version versendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A11</B><BR align="left"/><BR align="left"/><FONT>Es wurde bereits eine ausgerollte Leistungskurvendefinition für den Code der<BR align="left"/>Leistungskurvendefinition mit einer höheren Version versendet<BR align="left"/>Hinweis: Es ist als Referenz der Geschäftsvorfall zu benennen, mit welchem die<BR align="left"/>ausgerollte Leistungskurvendefinition übermittelt wurde.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "180" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>180: </B>Ist die versendete ausgerollte Leistungskurvendefinition plausibel?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A12" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A12</B><BR align="left"/><BR align="left"/><FONT>Ausgerollte Leistungskurvendefinition ist plausibel<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "200" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>200: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A99" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A99</B><BR align="left"/><BR align="left"/><FONT>Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2025 00:00 Uhr<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "Korrektur der Definition und die erneute Übermittlung durchführen." [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<FONT>Korrektur der Definition und die erneute Übermittlung durchführen.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "10" [color="#88a0d6"];
    "10" -> "20" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "40" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "A01" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "30" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "A02" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "50" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "70" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A03" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "60" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "A04" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "70" -> "80" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "70" -> "100" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "80" -> "A05" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "80" -> "90" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "A06" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "100" -> "110" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "100" -> "130" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "110" -> "A07" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "110" -> "120" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "120" -> "A08" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "120" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "130" -> "140" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "130" -> "160" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "140" -> "A09" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "140" -> "150" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "150" -> "A10" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "150" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "160" -> "170" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "160" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "170" -> "A11" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "170" -> "180" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "180" -> "A12" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "180" -> "200" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "200" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "200" -> "Korrektur der Definition und die erneute Übermittlung durchführen." [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
